# TP2 : Network low-level, Switching

# Sommaire

- [TP2 : Network low-level, Switching](#tp2--network-low-level-switching)
- [Sommaire](#sommaire)
- [I. Simplest setup](#i-simplest-setup)
      - [Topologie](#topologie)
      - [Plan d'adressage](#plan-dadressage)
- [II. More switches](#ii-more-switches)
      - [Topologie 2](#topologie-2)
      - [Plan d'adressage](#plan-dadressage-1)
      - [Mise en √©vidence du Spanning Tree Protocol](#mise-en-%c3%a9vidence-du-spanning-tree-protocol)
      - [Route ports](#route-ports)
      - [Reconfigurer STP](#reconfigurer-stp)
      - [üêô STP & Perfs](#%f0%9f%90%99-stp--perfs)
- [III. Isolation](#iii-isolation)
  - [1. Simple](#1-simple)
      - [Topologie 3](#topologie-3)
      - [Plan d'adressage](#plan-dadressage-2)
  - [2. Avec trunk](#2-avec-trunk)
      - [Topologie 4](#topologie-4)
      - [Plan d'adressage](#plan-dadressage-3)
- [IV. Need perfs](#iv-need-perfs)
      - [Topologie 5](#topologie-5)
      - [Plan d'adressage](#plan-dadressage-4)

**Dans ce TP, vous pouvez consid√©rez que :**
* les `PC` sont [**des VPCS de GNS3**](/memo/setup-gns3.md#utilisation-dun-vpcs) (sauf indication contraire)
* les `SW` sont des Switches Cisco, virtualis√© avec l'IOU L2

# I. Simplest setup

#### Topologie

```
+-----+        +-------+        +-----+
| PC1 +--------+  IOU1 +--------+ PC2 |
+-----+        +-------+        +-----+
```
#### Plan d'adressage

Machine | `net1`
--- | ---
`PC1` | `10.2.1.1/24`
`PC2` | `10.2.1.2/24`

Depuis PC1 : `ping 10.2.1.2`. Le protocole utilis√© est ICMP, mais le protocole ARP est utilis√© pour trouver la MAC correspondant √† l'adresse IP 10.2.1.2.


Sur PC1 :
```
show arp
00:50:79:66:68:01  10.2.1.2 expires in 117 seconds
```

Sur PC2 :
```
show arp
00:50:79:66:68:00  10.2.1.1 expires in 65 seconds
```

Le switch n'a pas besoin d'IP car c'est un switch il s'occupe de forward les trames 

# II. More switches

#### Topologie 2

```
                        +-----+
                        | PC4 |
                        +--+--+
                           |
                           |
                       +---+---+
                   +---+  IOU3 +----+
                   |   +-------+    |
                   |                |
                   |                |
+-----+        +---+---+        +---+---+        +-----+
| PC3 +--------+  IOU2 +--------+ IOU4  +--------+ PC5 |
+-----+        +-------+        +-------+        +-----+
```

* **IOU2** : c'est le *Route Bridge*, donc tous ses ports sont forwarded
* **IOU3** : son *Root port* est `eth1/0`
* **IOU4** : son *Root port* est `eth0/0`, son port bloqu√© est `eth2/0`


#### Plan d'adressage

Machine | `net1`
--- | ---
`PC3` | `10.2.2.1/24`
`PC4` | `10.2.2.2/24`
`PC5` | `10.2.2.3/24`

Sur PC3 :
```
show
NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
PC3    10.2.2.1/24          255.255.255.0     00:50:79:66:68:04  10016  127.0.0.1:10017
       fe80::250:79ff:fe66:6804/64
PC3> ping 10.2.2.2
84 bytes from 10.2.2.2 icmp_seq=1 ttl=64 time=0.307 ms
84 bytes from 10.2.2.2 icmp_seq=2 ttl=64 time=0.866 ms
PC3> ping 10.2.2.3
84 bytes from 10.2.2.3 icmp_seq=1 ttl=64 time=0.317 ms
84 bytes from 10.2.2.3 icmp_seq=2 ttl=64 time=0.980 ms
```
Sur SW2 :
```
show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0050.7966.6804    DYNAMIC     Et1/0 #MAC de PC3 00:50:79:66:68:04
   1    aabb.cc00.0201    DYNAMIC     Et1/0 #MAC de IOU2 sur le port et1/0
   1    aabb.cc00.0400    DYNAMIC     Et1/0 #MAC du IOU4 sur le port et0/0
   1    aabb.cc00.0402    DYNAMIC     Et2/0 #MAC du IOU4 sur le port et2/0
Total Mac Addresses for this criterion: 4
```

Sur les switches : `show interfaces <interface>` pour avoir toutes les infos (dont la mac). La table comprend une adresse MAC par lien (IOU2<->IOU3, IOU4<->IOU3 et IOU2<->IOU4), et la MAC du PC3 qui a effectu√© un ping. Les VLAN sont par d√©faut 1.

#### Mise en √©vidence du Spanning Tree Protocol

Si on consid√®re les trois liens qui unissent les switches :
* `IOU2` <> `IOU3`
* `IOU3` <> `IOU4`
* `IOU2` <> `IOU4`  

**L'un de ces liens a forc√©ment √©t√© d√©sactiv√©.**

Sur IOU2 : (on peut voir qu'il est le *Root bridge* du VLAN1)
```
show interfaces
Ethernet0/0 is up, line protocol is up (connected)
  Hardware is AmdP2, address is aabb.cc00.0200 (bia aabb.cc00.0200)
  MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Auto-duplex, Auto-speed, media type is unknown
  input flow-control is off, output flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:04, output 00:00:01, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/2000/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/0 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     235 packets input, 42468 bytes, 0 no buffer
     Received 235 broadcasts (0 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 input packets with dribble condition detected
     2411 packets output, 185796 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
IOU2#show sp
IOU2#show spanning-tree
VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     aabb.cc00.0200
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    Shr
Et0/1               Desg FWD 100       128.2    Shr
Et0/2               Desg FWD 100       128.3    Shr
Et0/3               Desg FWD 100       128.4    Shr
Et1/0               Desg FWD 100       128.5    Shr
Et1/1               Desg FWD 100       128.6    Shr
Et1/2               Desg FWD 100       128.7    Shr
Et1/3               Desg FWD 100       128.8    Shr
Et2/0               Desg FWD 100       128.9    Shr
Et2/1               Desg FWD 100       128.10   Shr
Et2/2               Desg FWD 100       128.11   Shr
Et2/3               Desg FWD 100       128.12   Shr
Et3/0               Desg FWD 100       128.13   Shr
Et3/1               Desg FWD 100       128.14   Shr
Et3/2               Desg FWD 100       128.15   Shr
Et3/3               Desg FWD 100       128.16   Shr
```
Sur IOU3 :
```
show interfaces
Ethernet0/0 is up, line protocol is up (connected)
  Hardware is AmdP2, address is aabb.cc00.0300 (bia aabb.cc00.0300)
  MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Auto-duplex, Auto-speed, media type is unknown
  input flow-control is off, output flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output 00:00:01, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/2000/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/0 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts (0 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 input packets with dribble condition detected
     2564 packets output, 199122 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets

IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     aabb.cc00.0200
             Cost        100
             Port        5 (Ethernet1/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    Shr
Et0/1               Desg FWD 100       128.2    Shr
Et0/2               Desg FWD 100       128.3    Shr
Et0/3               Desg FWD 100       128.4    Shr
Et1/0               Root FWD 100       128.5    Shr
Et1/1               Desg FWD 100       128.6    Shr
Et1/2               Desg FWD 100       128.7    Shr
Et1/3               Desg FWD 100       128.8    Shr
Et2/0               Desg FWD 100       128.9    Shr
Et2/1               Desg FWD 100       128.10   Shr
Et2/2               Desg FWD 100       128.11   Shr
Et2/3               Desg FWD 100       128.12   Shr
Et3/0               Desg FWD 100       128.13   Shr
Et3/1               Desg FWD 100       128.14   Shr
Et3/2               Desg FWD 100       128.15   Shr
Et3/3               Desg FWD 100       128.16   Shr
```
Sur IOU4 :
```
show interfaces
Ethernet0/0 is up, line protocol is up (connected)
  Hardware is AmdP2, address is aabb.cc00.0400 (bia aabb.cc00.0400)
  MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Auto-duplex, Auto-speed, media type is unknown
  input flow-control is off, output flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:00, output 00:00:06, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/2000/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/0 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     2085 packets input, 140911 bytes, 0 no buffer
     Received 2085 broadcasts (0 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 input packets with dribble condition detected
     364 packets output, 56478 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets

IOU4#show spanning-tree

VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     aabb.cc00.0200
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0400
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    Shr
Et0/1               Desg FWD 100       128.2    Shr
Et0/2               Desg FWD 100       128.3    Shr
Et0/3               Desg FWD 100       128.4    Shr
Et1/0               Desg FWD 100       128.5    Shr
Et1/1               Desg FWD 100       128.6    Shr
Et1/2               Desg FWD 100       128.7    Shr
Et1/3               Desg FWD 100       128.8    Shr
Et2/0               Altn BLK 100       128.9    Shr
Et2/1               Desg FWD 100       128.10   Shr
Et2/2               Desg FWD 100       128.11   Shr
Et2/3               Desg FWD 100       128.12   Shr
Et3/0               Desg FWD 100       128.13   Shr
Et3/1               Desg FWD 100       128.14   Shr
Et3/2               Desg FWD 100       128.15   Shr
Et3/3               Desg FWD 100       128.16   Shr
```
#### Route ports

Ping entre PC3 et PC4 : On voit bien le ping passer par ce lien. Le lien d√©sactiv√© est celui entre IOU3 et IOU4 car aucun des deux n'est le route bridge et il n'est donc pas n√©cessaire.


#### Reconfigurer STP

```
# AVANT
IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     aabb.cc00.0200
             This bridge is the root
# APRES
conf t
spanning-tree vlan 1 priority 4096
IOU4#show spanning-tree

VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    4097
             Address     aabb.cc00.0400
             This bridge is the root

```

On voit que dans les √©changes STP, la nouvelle mac consid√©r√©e comme ROOT BRIDGE est celle de IOU4 (aa:bb:cc:00:04:00)

#### üêô STP & Perfs

Sur IOU3, l'interface `eth0/3` est reli√©e au PC :
```
IOU3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU3(config)#interface et 0/3
IOU3(config)#interface et 0/3
IOU3(config-if)#switchport mode access
IOU3(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on Ethernet0/3 but will only
 have effect when the interface is in a non-trunking mode.
IOU3(config-if)#spanning-tree bpduguard enable
IOU3(config-if)#spanning-tree bpdufilter enable
IOU3(config-if)#no cdp enable
```
# III. Isolation

## 1. Simple
 
#### Topologie 3
```
+-----+        +-------+        +-----+
| PC6 +--------+ IOU5  +--------+ PC8 |
+-----+      10+-------+20      +-----+
                 20|
                   |
                +--+--+
                | PC7 |
                +-----+
```

#### Plan d'adressage

Machine | IP `net1` | VLAN
--- | --- | --- 
`PC6` | `10.2.3.1/24` | 10
`PC7` | `10.2.3.2/24` | 20
`PC8` | `10.2.3.3/24` | 20

Sur IOU5 :
```
IOU5#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
                                                Et1/0, Et1/1, Et1/2, Et1/3
                                                Et2/0, Et2/1, Et2/2, Et2/3
                                                Et3/0, Et3/1, Et3/2, Et3/3
IOU5#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU5(config)#vlan 10
IOU5(config-vlan)#name client-10
IOU5(config-vlan)#exit
IOU5(config)#interface et 0/0
IOU5(config-if)#switchport mode access
IOU5(config-if)#switchport access vlan 10
IOU5(config-if)#exit
IOU5(config)#vlan 20
IOU5(config-vlan)#name client-20
IOU5(config-vlan)#exit
IOU5(config)#interface et 1/0
IOU5(config-if)#switchport mode access
IOU5(config-if)#switchport access vlan 20
IOU5(config-if)#exit
IOU5(config)#interface et 2/0
IOU5(config-if)#switchport mode access
IOU5(config-if)#switchport access vlan 20
IOU5(config-if)#exit
IOU5#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/1, Et0/2, Et0/3, Et1/1
                                                Et1/2, Et1/3, Et2/1, Et2/2
                                                Et2/3, Et3/0, Et3/1, Et3/2
                                                Et3/3
10   client-10                        active    Et0/0
20   client-20                        active    Et1/0, Et2/0

PC6> ping 10.2.3.2
host (10.2.3.2) not reachable
PC6> ping 10.2.3.3
host (10.2.3.3) not reachable

PC7> ping 10.2.3.3
84 bytes from 10.2.3.3 icmp_seq=1 ttl=64 time=0.241 ms
84 bytes from 10.2.3.3 icmp_seq=2 ttl=64 time=0.308 ms
PC7> ping 10.2.3.1
host (10.2.3.1) not reachable
```
(Seules les parties int√©ressantes du `show vlan` ont √©t√© gard√©es)

## 2. Avec trunk

#### Topologie 4

```
+-----+        +-------+        +-------+        +-----+
| PC9 +--------+  SW1  +--------+  SW2  +--------+ PC12|
+-----+      10+-------+        +-------+20      +-----+
                 20|              10|
                   |                |
                +--+--+          +--+--+
                | PC10|          | PC11|
                +-----+          +-----+
```

#### Plan d'adressage

Machine | IP `net1` | IP `net2` | VLAN
------ | --- | --- | ---
`PC9`  | `10.2.10.1/24` | X | 10
`PC10` | X | `10.2.20.1/24` | 20
`PC11` | `10.2.10.2/24` | X | 10
`PC12` | X | `10.2.20.2/24` | 20

M√™mes commandes sur IOU6 et IOU7 :
```
IOU6#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU6(config)#vlan 10
IOU6(config-vlan)#name client-10
IOU6(config-vlan)#exit
IOU6(config)#interface et 0/0
IOU6(config-if)#switchport mode access
IOU6(config-if)#switchport access vlan 10 # vlan 20 pour IOU7
IOU6(config-if)#exit
IOU6(config)#vlan 20
IOU6(config-vlan)#name client-20
IOU6(config-vlan)#exit
IOU6(config)#interface et 2/0
IOU6(config-if)#switchport mode access
IOU6(config-if)#switchport access vlan 20 # vlan 10 pour IOU7
IOU6(config-if)#exit
IOU6(config)#interface et 1/0
IOU6(config-if)#switchport trunk encapsulation dot1q
IOU6(config-if)#switchport mode trunk
IOU6(config-if)#switchport trunk allowed vlan 10,20
```
V√©rifications :
```
PC9> ping 10.2.10.2
84 bytes from 10.2.10.2 icmp_seq=1 ttl=64 time=0.348 ms
84 bytes from 10.2.10.2 icmp_seq=2 ttl=64 time=0.484 ms
84 bytes from 10.2.10.2 icmp_seq=3 ttl=64 time=0.605 ms
84 bytes from 10.2.10.2 icmp_seq=4 ttl=64 time=0.831 ms
84 bytes from 10.2.10.2 icmp_seq=5 ttl=64 time=0.612 ms

PC9> ping 10.2.20.1
host (255.255.255.0) not reachable

PC9> ping 10.2.20.2
host (255.255.255.0) not reachable

PC10> ping 10.2.20.2
84 bytes from 10.2.20.2 icmp_seq=1 ttl=64 time=0.393 ms
84 bytes from 10.2.20.2 icmp_seq=2 ttl=64 time=0.588 ms
84 bytes from 10.2.20.2 icmp_seq=3 ttl=64 time=0.847 ms
84 bytes from 10.2.20.2 icmp_seq=4 ttl=64 time=0.599 ms
84 bytes from 10.2.20.2 icmp_seq=5 ttl=64 time=0.565 ms

PC10> ping 10.2.10.1
host (255.255.255.0) not reachable

PC10> ping 10.2.10.2
host (255.255.255.0) not reachable
```

# IV. Need perfs

#### Topologie 5

```
+-----+        +-------+--------+-------+        +-----+
| PC13+--------+  IOU8 |        |  IOU9 +--------+ PC16|
+-----+      10+-------+--------+-------+20      +-----+
                 20|              10|
                   |                |
                +--+--+          +--+--+
                | PC14|          | PC15|
                +-----+          +-----+

```

#### Plan d'adressage


Machine | IP `net1` | IP `net2` | VLAN
--- | --- | --- | ---
`PC13` | `10.2.10.1/24` | X | 10
`PC14` | X | `10.2.20.1/24` | 20
`PC15` | `10.2.10.2/24` | X | 10
`PC16` | X | `10.2.20.2/24` | 20

M√™mes commandes que la partie pr√©c√©dentes pour les VLAN.

M√™mes commandes sur IOU8 et IOU9 :
```
IOU9(config)#interface et 3/0
IOU9(config-if)#switchport
IOU9(config-if)#channel-protocol lacp
IOU9(config-if)#channel-group 1 mode active
Creating a port-channel interface Port-channel 1

IOU9(config-if)#exi
IOU9(config)#interface et 3/1
IOU9(config-if)#switchport
IOU9(config-if)#channel-protocol lacp
*Oct 16 18:28:01.513: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to up
IOU9(config-if)#channel-protocol lacp
IOU9(config-if)#channel-group 1 mode active
IOU9(config-if)#exit
IOU9(config)#exit
IOU9#
*Oct 16 18:28:08.664: %SYS-5-CONFIG_I: Configured from console by console
IOU9#show ip interface po1
Port-channel1 is up, line protocol is up
  Inbound  access list is not set
  Outgoing access list is not set
IOU9#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU9(config)#interface po1
IOU9(config-if)#
*Oct 16 18:30:24.559: %LINK-3-UPDOWN: Interface Port-channel1, changed state to up
*Oct 16 18:30:25.563: %LINEPROTO-5-UPDOWN: Line protocol on Interface Port-channel1, changed state to up
IOU9(config-if)#switchport trunk encapsulation dot1q
IOU9(config-if)#switchport mode trunk
IOU9(config-if)#switchport trunk allowed vlan 10,20
IOU9(config-if)#exit
IOU9(config)#exit
```
V√©rifications :
```
PC13> ping 10.2.10.2
84 bytes from 10.2.10.2 icmp_seq=1 ttl=64 time=0.729 ms
84 bytes from 10.2.10.2 icmp_seq=2 ttl=64 time=0.670 ms
84 bytes from 10.2.10.2 icmp_seq=3 ttl=64 time=0.563 ms
84 bytes from 10.2.10.2 icmp_seq=4 ttl=64 time=0.676 ms
84 bytes from 10.2.10.2 icmp_seq=5 ttl=64 time=0.573 ms

PC13> ping 10.2.20.1
host (255.255.255.0) not reachable

PC14> ping 10.2.20.2
84 bytes from 10.2.20.2 icmp_seq=1 ttl=64 time=0.676 ms
84 bytes from 10.2.20.2 icmp_seq=2 ttl=64 time=1.036 ms
84 bytes from 10.2.20.2 icmp_seq=3 ttl=64 time=0.604 ms
84 bytes from 10.2.20.2 icmp_seq=4 ttl=64 time=0.507 ms
84 bytes from 10.2.20.2 icmp_seq=5 ttl=64 time=0.510 ms

PC14> ping 10.2.10.2
host (255.255.255.0) not reachable
```
